Duet3D/Duet3Expansion/src/atmel/SAMC20_DFP/1.1.95/samc20/atdf/ATSAMC20G18A.atdf
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="XOSCCKSW" caption="XOSC Clock Switch" mask="0x4"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x200"/>
          <bitfield name="DPLLTO" caption="DPLL Timeout" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x800"/>
        </register>
        <register name="XOSCCTRL" offset="0x10" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="CFDEN" caption="Xosc Clock Failure Detecteor Enable" mask="0x8"/>
          <bitfield name="SWBEN" caption="Xosc Clock Switch Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000"/>
        </register>
        <register name="CFDPRESC" offset="0x12" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Prescaler">
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x7"/>
        </register>
        <register name="EVCTRL" offset="0x13" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
        </register>
        <register name="OSC48MCTRL" offset="0x14" rw="RW" size="1" initval="0x82" caption="48MHz Internal Oscillator (OSC48M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="OSC48MDIV" offset="0x15" rw="RW" access="WSYNC" size="1" initval="0x0B" caption="OSC48M Divider">
          <bitfield name="DIV" caption="OSC48M Division Factor" mask="0xF"/>
        </register>
        <register name="OSC48MSTUP" offset="0x16" rw="RW" size="1" initval="0x07" caption="OSC48M Startup Time">
          <bitfield name="STARTUP" caption="Startup Time" mask="0x7"/>
        </register>
        <register name="OSC48MSYNCBUSY" offset="0x18" rw="R" size="4" initval="0x00000000" caption="OSC48M Synchronization Busy">
          <bitfield name="OSC48MDIV" caption="OSC48MDIV Synchronization Status" mask="0x4"/>
        </register>
        <register name="DPLLCTRLA" offset="0x1C" rw="RW" access="WSYNC" size="1" initval="0x80" caption="DPLL Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x20" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Digital Core Configuration">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLPRESC" offset="0x28" rw="RW" access="WSYNC" size="1" initval="0x00" caption="DPLL Prescaler">
          <bitfield name="PRESC" caption="Output Clock Prescaler" mask="0x3" values="OSCCTRL_DPLLPRESC__PRESC"/>
        </register>
        <register name="DPLLSYNCBUSY" offset="0x2C" rw="R" size="1" initval="0x00" caption="DPLL Synchronization Busy">
          <bitfield name="ENABLE" caption="DPLL Enable Synchronization Status" mask="0x2"/>
          <bitfield name="DPLLRATIO" caption="DPLL Ratio Synchronization Status" mask="0x4"/>
          <bitfield name="DPLLPRESC" caption="DPLL Prescaler Synchronization Status" mask="0x8"/>
        </register>
        <register name="DPLLSTATUS" offset="0x30" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
        <register name="CAL48M" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="48MHz Oscillator Calibration">
          <bitfield name="FCAL" caption="Frequency Calibration (48MHz)" mask="0x3F"/>
          <bitfield name="FRANGE" caption="Frequency Range (48MHz)" mask="0x300"/>
          <bitfield name="TCAL" caption="Temperature Calibration (48MHz)" mask="0x3F0000"/>
        </register>
      </register-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="2.1.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
